# PANDAS TUTORIAL
pandas is an open source bsd licensed library high performance

In [16]:
import pandas as pd
import numpy as np
# data frame is the collection of many columns

In [3]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=["ROW1","ROW2","ROW3","ROW4","ROW5"],columns=["Column1","Column2","Column3","Column4"])

In [4]:
df

      Column1  Column2  Column3  Column4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [5]:
df.head()

      Column1  Column2  Column3  Column4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [7]:
df.tail()

      Column1  Column2  Column3  Column4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [9]:
df.to_csv("test1.csv")

In [14]:
df.loc["ROW1"]
# ACCESSING THE ELEMENTS OF THE ROW

Column1    0
Column2    1
Column3    2
Column4    3
Name: ROW1, dtype: int32

In [15]:
type(df.loc["ROW1"])
# check the type 
# it is a searies necause it has only one row

pandas.core.series.Series

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.shape

(5, 4)

In [19]:
df.size

20

In [23]:
df.iloc[0:3,0:2]
# printing the specific rows and columns

      Column1  Column2
ROW1        0        1
ROW2        4        5
ROW3        8        9

In [25]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [27]:
df.iloc[:,1:].values.shape

(5, 3)

In [30]:
df.iloc[:,1:].values#converted into array

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [31]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [40]:
df

      Column1  Column2  Column3  Column4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [37]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [39]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, ROW1 to ROW5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
dtypes: int32(4)
memory usage: 292.0+ bytes

In [50]:
d=pd.read_csv("FIFA - 2018.csv")

In [84]:
type(d.Team)

pandas.core.series.Series

In [85]:
d=pd.read_csv("FIFA - 2018.csv",index_col=0)

type(d.Team)

pandas.core.series.Series

In [82]:
d.iloc[0]

Team               France
Games Played            7
Win                     6
Draw                    1
Loss                    0
Goals For              14
Goals Against           6
Goal Difference         8
Points                 19
Name: 1, dtype: object

In [79]:
d.shape

(32, 9)

In [59]:
d.size

320

In [61]:
d.describe()

,Position,Games Played,Win,Draw,Loss,Goals For,Goals Against,Points
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000
mean,16.500000,4.000000,1.593750,0.812500,1.593750,5.281250,5.281250,5.593750
std,9.380832,1.344043,1.583369,0.895779,0.797552,4.065864,2.203141,4.804966
min,1.000000,3.000000,0.000000,0.000000,0.000000,2.000000,2.000000,0.000000
25%,8.750000,3.000000,1.000000,0.000000,1.000000,2.000000,4.000000,3.000000
50%,16.500000,3.500000,1.000000,1.000000,2.000000,3.500000,5.000000,4.000000
75%,24.250000,4.250000,2.000000,1.000000,2.000000,6.250000,6.250000,7.250000
max,32.000000,7.000000,6.000000,3.000000,3.000000,16.000000,11.000000,19.000000

In [64]:
e=pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

In [65]:
e

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [66]:
type(e)

pandas.core.series.Series